Repository: yamato/perl6doc-jp
Catalog: omegat/project_save.tmx
Source language: en_us
Languages: ja

source: A once runs separately for each clone, so separate clones can keep separate state variables:
ja: onceはそれぞれの複製で別々に実行するので、別々の複製は異なるstate変数を保持できる：

source: A token declares a regex that does not backtrack by default, so that when a partial pattern match fails, the regex engine will not go back up and try another alternative (this is equivalent to using the :ratchet modifier).
ja: tokenはデフォルトでバックトラックしない正規表現を宣言します。そのため、部分マッチが失敗するとき、正規表現エンジンは上に戻らないで別の選択肢を試します（これは:ratchet修飾子を使用することと同等です）。

source: A when statement implicitly does a "smart match" between the current topic ($_) and the argument of the when.
ja: when文は現在のトピック（$_）とwhenの引数の間で暗黙に「スマートマッチ」を行う。

source: A rule will also not backtrack by default, additionally, sequences of whitespace are deemed significant and will match actual whitespace within the string using the built-in <ws> rule (this is equivalent to using the :sigspace modifier).
ja: ruleもデフォルトでバックトラックしません。さらに、空白文字のシーケンスは重要であるとみなして、ビルトイン<ws>ルール（これは:sigspace修飾子を使用することと同等です）を用いた文字列の中で実際の空白文字にマッチするでしょう。

source: A quantifier specifies how often something has to occur.
ja: 数量詞は、何かがどれくらい起こらなければならないかについて指定します。

source: A role is a standalone, named, and reusable unit of behavior.
ja: roleはスタンドアロンで、名前をつけられて、再使用できる振る舞いの単位です。

source: A statement ends with a semicolon or a curly bracket at the end of a line:
ja: ステートメントは行末のセミコロン、またはカーリーブラケットで終わります：

source: A subroutine is a piece of code that performs a specific task.
ja: サブルーチンは特定の仕事をこなすコードの断片です。

source: A name is anything that is a legal part of a variable name (not counting the sigil).
ja: 名前は変数名（シギルは数えない）の有効な部分なら何でもです。

source: A Boolean value is either True or False.
ja: 真偽値はTrueかFalseです。

source: A Pair stores a key and a value; the key is on the left-hand side of the => operator, the value on the right.
ja: Pairはキーと値を保存します；キーは=>演算子の左側にあり、値は右側です。

source: A Perl 6 program consists of zero or more statements.
ja: Perl 6プログラムは1つ以上のステートメントから成ります。

source: A Perl 6 version might be:
ja: Perl 6バージョンはこうなるはずです：

source: A Word on Precedence
ja: 優先順位のワード

source: A bare die/fail takes $! as the default argument specifying the exception to be thrown or propagated outward to the caller's $!.
ja: 裸のdie/failはスローされるか外側に伝搬される呼び出し元の$!を明示する$!をデフォルトの引数としてとる。

source: A bare closure (except the block associated with a conditional statement) without placeholder arguments that uses $_ (either explicitly or implicitly) is treated as though $_ were a formal parameter:
ja: $_（明示的か暗黙的かどちらか）を使うプレースホルダー引数無しの裸のクロージャ（条件付きの文に関連付けられているブロックは除く）は$_が仮パラメータかのように扱われる：

source: A block is a self-contained piece of Perl 6 code with an optional signature (the -> $line part).
ja: ブロックはオプションのシグネチャ（-> $lineの部分）を伴う独立したPerl 6コードの断片です。

source: A block is any part of the code enclosed between curly braces { }.
ja: ブロックとはブレース{ }で囲まれたあらゆる部分です。

source: A call like to-json(2) has two matching candidates--Int and Any.
ja: to-json(2)のような呼び出しは、マッチする2つの候補 ― IntとAny ― を持っています。

source: A call may also be partially applied (primed) by using the .assuming method:
ja: 呼び出しは.assumingメソッドを用いて部分的に適用される（満たされる）こともできます。

source: A call such as to-json(Bool::True) invokes the first candidate.
ja: to-json(Bool::True)のような呼び出しは最初の候補を起動します。

source: A capture preserves the two array arguments, so that the final callee's signature may determine how to bind them.
ja: キャプチャーは2つの配列引数を保存します、そのため、最終的な呼び出し先のシグネチャーはそれらを結びつける方法を決定します。

source: A class is a module and thus can export stuff, but a class adds even more behavior to support Perl 6's standard class-based OO.
ja: クラスはモジュールなのでものをエクスポートすることができます。しかしPerl 6の標準のクラスベースのOOをサポートするためにより多くの動作をクラスは追加します。

source: A class is a module declared with the class keyword.
ja: クラスはclassキーワードで宣言されるモジュールです。

source: A closure returning the default value
ja: デフォルト値を返すクロージャ

source: A colon : switches off backtracking for the previous quantifier or alternation.
ja: コロン:は、前の数量詞または論理和のためにバックトラックのスイッチを切ります。

source: A common writing error is to duplicate a word by accident.
ja: 一般の文書エラーは、偶然にワードが重複することです。

source: A constructor is anything that returns an instance of the class.
ja: コンストラクタは、クラスのインスタンスを返すものなら何でもそうです。

source: A grammar contains various named regex.
ja: グラマーは様々な名前の正規表現を含みます。

source: A leading exclamation mark negates the meaning, such that the lookahead must not find the regex fragment.
ja: 先読みが正規表現の断片を見つけてはならないように、先行するエクスクラメーションマークは意味を否定します。

source: A line ending with a closing brace "}", followed by nothing but whitespace or comments, will terminate a statement if an end of statement can occur there.
ja: 閉じ括弧}で終わり、次に何も続かない行末（空白文字とコメントは除く）は文の終了を発生させることができるなら文を終了する。

source: A list of zero or more comma-separated objects may be grouped together by parentheses into a "parenthesis cell", or Parcel.
ja: 0以上のコンマで区切られたオブジェクトは括弧によって“括弧セル”またはParcelにグループ化されます。

source: A named argument of the form :name with no value has an implicit value of Bool::True.
ja: 値のない名前付き引数の:nameという形式は暗黙にBool::Trueを持っています。

source: A nested signature to bind the argument against
ja: 引数をバインドするネストしたシグネチャー

source: A nominal type is an actual class or role, as opposed to additional constraints in the form of code blocks.
ja: コードブロック形式の更なる制約とは対照的に、名目の型は、実際のクラスまたはロールです。

source: A pair consists of a string key and a value, so the action method constructs a Perl 6 pair with the => operator.
ja: ペアは文字列キーと値から成るので、アクションメソッドは=>演算子でPerl 6ペアを構築します。

source: A possible candidate:
ja: 可能な候補：

source: A question mark ? makes the preceding unit (be it a letter, a character class, or something more complicated) optional, meaning it can either be present either zero or one times.
ja: 疑問符?はすぐ前の単位（文字、文字クラスまたはより複雑な何か）を任意にさせます。0または1回存在することができるという意味です。

source: A regex on the right hand side of the ~~ smart match operator applies against the string on the left hand side.
ja: ~~スマートマッチ演算子の右側の正規表現は、左側の文字列に対して適用します。

source: A role contains the methods and attributes required to provide a named, reusable unit of behavior.
ja: ロールは、名前付きの再利用可能な振る舞いの単位の提供を必要とされるメソッドと属性を含みます。

source: A role is another type of package.
ja: ロールはパッケージの別の型です。

source: A routine can choose to delegate its work to other candidates in that list.
ja: ルーチンはそのリストでその作業を他の候補に委任するほうを選ぶことができます。

source: A scalar can even contain a compound object like an Array or a Hash; the $ sigil signifies that it should be treated as a single value, even in a context that expects multiple values (as with an Array or Hash).
ja: スカラーはArrayまたはHashのような複合オブジェクトさえ含むことができます；複数の値（ArrayまたはHashと同様に）を期待するコンテキストでも、$シギルはそれが1つの値とみなされるべきことを示します。

source: A scalar uses the $ sigil and implies no constraints.
ja: $シギルを使うスカラーは制約がないことを示します。

source: A signature object (Signature) may be created with colon-prefixed parens:
ja: シグネチャーオブジェクト（Signature）はコロンを前につけた括弧で作成されます：

source: A similar approach might generate a command line interface along with some basic usage instructions.
ja: 類似したアプローチは、若干の基本的な使用命令とともにコマンドラインインターフェースを生み出すかもしれません。

source: A single $ in a signature identifies an anonymous scalar variable.
ja: シグネチャーの一つの$は、匿名のスカラー変数を識別します。

source: A single caret ^ anchors the regex to the start of the string and a dollar sign $ to the end.
ja: シングルキャレット^は文字列の開始、ドル記号$は終わりに正規表現を固定します。

source: A string is a piece of text, and a string literal is a string which appears directly in the program.
ja: 文字列はテキストの断片です。そして文字列リテラルはプログラム中に直接現れる文字列です。

source: A subroutine can also return multiple values:
ja: サブルーチンは複数の値を返すこともできます：

source: A subroutine declaration consists of several parts.
ja: サブルーチンの宣言はいくつかのパーツから成ります。

source: A subroutine signature performs two tasks.
ja: サブルーチンシグネチャーは2つのタスクを実行します。

source: A successfully evaluated constraint makes a match narrower than a similar signature without a constraint.
ja: うまく評価された制約は、マッチを制約のない類似したシグネチャーより制限されたようにします。

source: A switch statement is a means of topicalizing, so the switch keyword is the English topicalizer, given.
ja: switch文はトピカライズの手段だ。そういうわけで、switchキーワードは英語のトピカライザー、givenだ。

source: A term can be a literal like 8 or 'Dave', or a combination of other terms and operators.
ja: 項は8または'Dave'のようなリテラル、または他の項と演算子の組み合わせが可能です。

source: A term can have zero or more prefix operators, so you can actually write say 4 + -5.
ja: 項はゼロまたはそれより多くの接頭辞演算子を持つことができるので、実はsay 4 + -5と書くことが可能です。

source: A third option is to allow labeled gather/take for such a situation, and dynamic take must match the gather's label (or lack thereof) exactly.
ja: 三つ目の選択はラベル付きgather/takeをそのような状況のために許可すること、そしてダイナミックなtakeはgatherのラベル（またはそれの欠如）に完全に一致する必要がある。

source: A token with the :sigspace modifier is a rule:
ja: :sigspace修飾子によるトークンは、ruleです：

source: A twigil forms part of the name of the variable.
ja: twigilは、変数の名前の一部をなします。

source: A typical use case for three-way comparison is sorting.
ja: 三者間の比較の典型的使用例はソートです。

source: A variable may itself be bound to a container type that specifies how the container works, without specifying what kinds of things it contains.
ja: どんな種類のものを含むか指定することなく、どのように機能するか指定しているコンテナ型に変数がバインドされている場合があります。

source: A variable name begins with a sigil, which is a non-alpha-numeric symbol such as $, @, %, or &--or occasionally the double colon ::.
ja: 変数名はシギル（$、@、%または&のような非英語シンボル）― または時々2つのコロン::で始まります。

source: A variable's sigil indicates its intended use.
ja: 変数のシギルはその使用の意図を示します。

source: A variable's type is a constraint indicating what sorts of values the variable may contain.
ja: 変数の型は、どんな種類の値を含むかについて示している制約です。

source: A variant of do is gather.
ja: doの変形はgatherだ。

source: Abstract and Concrete Parameters
ja: 抽象と具体的パラメータ

source: According to S12, properties are actually implemented by a kind of mixin mechanism, and such mixins are accomplished by the generation of an individual anonymous class for the object (unless an identical anonymous class already exists and can safely be shared).
ja: S12によると、プロパティは実際のところ一種のミックスインメカニズムで実現されます。そのようなミックスインは個々のオブジェクト（同一の匿名クラスが既に存在し、安全に共有できるのでなければ）のための匿名クラスの生成によって達成されます。

source: Adding 1 to it leaves space for a single blank space between the name of the longest player and the left edge of the bars.
ja: バーの端と最も長い名前のプレーヤーの間には1つ離れた空白を加えます。

source: Adding Constraints
ja: 制約を追加する

source: Adding Signatures
ja: シグネチャーを追加する

source: Adding to an entry that is not in the hash yet will cause that entry to spring into existence just-in-time, with a value starting at zero.
ja: まだハッシュにないエントリーを追加すると、ジャストインタイムで値がゼロで始まって存在するようになります。

source: Additionally, it requires that the first positional parameter be an indexable item--anything that would match the @ sigil.
ja: その上それは、最初のポジションのパラメータがインデックス可能なアイテム ― @にシギルに合うものを見つけるどんなものも ― であることを必要とします。

source: Additionally, the :_ adverb allows either defined or undefined values.
ja: さらに、:_副詞は定義済みか未定義の値を許します。

source: Additionally, the try block or statement implicitly enforces a use fatal context such that failures are immediately thrown as exceptions.
ja: 加えて、tryブロックまたは文は暗黙的に失敗が例外として即時にスローされるようにuse fatalコンテキストを強要する。

source: Additionally, they also allow you to explicitly specify the return type of a subroutine.
ja: その上、サブルーチンの戻り値の型を明示的に指定することもできます。

source: After all of the dependencies have completed, it's time to perform the current Task's task by invoking the &!callback attribute directly; this is the purpose of the parentheses.
ja: 全ての依存が完了した後は、現在のTaskの仕事を&!callback属性を直接起動して実行するときです；これは括弧の目的です。

source: After composition, the class appears as if those attributes and methods had been declared in the class's declaration itself.
ja: 合成の後、そのクラスはまるでそれらの属性とメソッドがクラス自身の宣言そのものにおいて宣言されたように発生します。

source: After creating a class, you can create instances of the class.
ja: クラスを作成した後に、あなたはクラスのインスタンスを作ることができます。

source: After it finishes its work, it can delegate to its parent class meethod by calling nextsame.
ja: 作業を終えたあと、それはnextsameを呼ぶことによって親クラスメソッドにデリゲートすることができます。

source: After matching the anchor at the start of the string, the regex attempts to match either an <array> or an <object>.
ja: 文字列の始まりでアンカーにマッチした後に、正規表現は<array>か<object>にマッチしようと試みます。

source: After optional spaces, two slashes '//' introduce a comment, after which must follow an arbitrary number of non- newline characters, and then a newline.
ja: 任意の空白の後、2つのスラッシュ'//'はコメントを導入します。それの後には任意の数の非改行文字、そして改行文字が続かなければなりません。

source: After processing the first line of the file, the variables contain the values:
ja: ファイルの最初の行を処理した後に、変数は次の値を含みます：

source: After processing the first line, $pairing will hold the string Ana Dave and $result 3:0.
ja: 最初の行を処理した後、$pairingは文字列Ana Dave、 $resultは3:0を保持します。

source: After the + (an infix operator), the compiler expects a term, so as to interpret the - as a prefix operator to the term 5.
ja: +（接中辞演算子）の後にコンパイラは項を期待するので、-を項5の接頭辞演算子と解釈します。

source: After the called routine has done its work, the callee can continue its work.
ja: 呼び出されるルーチンが作用を及ぼしたあと、呼び出し先はその作業を続けることができます。

source: After the first sorting step, the names are in the order Beth Charlie Dave Ana.
ja: 最初のソートステップの後、名前の順序はBeth Charlie Dave Anaです。

source: After the second sorting step, it's still the same, because no one has won fewer matches but more sets than someone else.
ja: 第2のソートステップの後、セット数以外で誰も他の誰かより多くの試合に勝っていないので、それはまだ同じです。

source: After the sigil comes an identifier, which may consist of letters, digits and the underscore.
ja: シギルの後に来るのは識別子で、それは文字、数値、アンダースコアから成ります。

source: After these two lines have run for the first time, %sets contains 'Ana' => 3, 'Dave' => 0.
ja: これらの2行が初めて実行された後、%setsは'Ana' => 3, 'Dave' => 0を含みます。

source: After this postcircumfix operator is an ordinary postfix operator with name ++, which increments the value it qualifies.
ja: この後置接周辞演算子の後は++という名前の、値を修飾してインクリメントする普通の接尾辞演算子です。

source: After working through this book, you should have a solid grasp of the basics of Perl 6 sufficient to solve your own problems with Perl 6.
ja: この本で勉強した後に、あなたはPerl 6に関するあなた自身の問題を解決するのに十分なPerl 6の基本を、しっかり把握しているはずです。

source: All abnormal control flow is, in the general case, handled by the exception mechanism (which is likely to be optimized away in specific cases.) Here "abnormal" means any transfer of control outward that is not just falling off the end of a block.
ja: 全てのアブノーマルな制御フローは、一般の場合、例外メカニズムによって扱われる（それはたぶん特定のケースに最適化される）。ここで「アブノーマル」は何か一つの外側への制御の転送を意味する。そしてそれはブロックの終端から離れるだけではない。

source: All calls build a capture on the caller side and unpack it according to the signature on the callee side (footnote: An optimizing Perl 6 compiler may, of course, be able to optimize away part or all of this process, depending on what it knows at compilation time.).
ja: 全ての呼び出しは呼び出し側でキャプチャーを構築し、呼び出された側のシグネチャーでアンパックします（注釈：最適化されたPerl 6コンパイラは、もちろん、このプロセスを最適化できます。コンパイル時に何かを知ることに従って）。

source: All numbers except zero evaluate to True.
ja: ゼロを除く全ての数はTrue。

source: All of the examples in this book will run with the Rakudo Perl 6 Compiler, but they are in no way specific to Rakudo--any sufficiently advanced Perl 6 implementation can run them.
ja: この本の例はすべてRakudo Perl 6コンパイラで動作します。しかし、それらは決してRakudoに特有ではありません ― 十分に先進なPerl 6実装ならなんでもそれらを動作させることができます。

source: All of the three operators above are infix operators, which means they stand between two terms.
ja: 上の3つの演算子は全て中置演算子です。そしてそれは2つの項の間に立つことを意味します。

source: All other characters may have a special meaning.
ja: 他の文字は特別な意味を持っています。

source: All other names (including implicit names of operators) are looked up in the lexical scope of the caller when we actually know who the caller is at run time.
ja: 全ての他の名前（演算子の暗黙の名前を含む）は我々が実行時に呼び出し元が誰か実際に知っている時、呼び出し元のレキシカルスコープで探索される。

source: All other strings evaluate to True.
ja: 他のすべての文字列はTrueと評価する。

source: All possible roles are equal in role composition.
ja: すべての使用可能なロールは、ロール合成において平等です。

source: Also current implementations have problems with dumping cyclic data structures this way, but they are expected to be handlded correctly by .perl at some point.), it is very useful for debugging simple objects.
ja: また、現在の実装は循環したデータ構造のダンプに問題を抱えています。しかしそれらは.perlによっていくつかの点で正しく扱われると思われます）。単純なオブジェクトをデバッグするのに非常に有用です。

source: Also, !$!done is unnecessarily hard to read if you see !
ja: また、!$!doneは読むのは必要以上に難しいです！

source: Also, currying or partial application?
ja: また、カリーまたはパーシャルアプリケーション？

source: Also, the description of scoping may be subtle here.
ja: また、スコーピングの説明はここでは捉えがたいです。

source: Alternately, the return type may be specified within the signature:
ja: あるいは、戻り値の型はシグネチャで指定可能です：

source: Alternative Named Argument Syntaxes
ja: 名前付き引数の代替文法

source: Although a bare block occurring as a single statement is no longer a do-once loop, it still executes immediately as in Perl 5, as if it were immediately dereferenced with a .() postfix, so within such a block CALLER:: refers to the dynamic scope associated with the lexical scope surrounding the block.
ja: とはいえ、単独の文として生じる裸のブロックはもはやdo-onceループではない。 それはまだPerl 5のように実行される。まるで.()接尾辞でただちにデリファレンスされるかのように。それゆえ、そのようなブロック内のCALLER::はブロックを囲んでいるレキシカルスコープに関連付けられているダイナミックスコープ参照する。

source: Although the rules and action methods live in different namespaces (and in a real-world project probably even in separate files), here they are adjacent to demonstrate their correspondence:
ja: ルールとアクションメソッドは異なる名前空間（そして、実際のプロジェクトではおそらく別々のファイル）に存在しますが、ここでは、それらの対応関係を示すために隣接しています：

source: Ampersand and invocation
ja: アンパサンドと起動

source: An array contains value.
ja: arrayはvalueを含みます。

source: An of type on an array or hash specifies the type stored by each element:
ja: 配列またはハッシュでのof型は個々の要素で保存される型を指定します。

source: An of type is given as a prefix or with the of keyword:
ja: of型は接頭辞またはofキーワードで与えられます：

source: An INIT only runs once for all copies of a cloned closure.
ja: INITは全ての複製されたクロージャで1回だけ実行する。

source: An identifier is composed of an alphabetic character followed by any sequence of alphanumeric characters.
ja: 識別子は英数字のシーケンスが続く英字で構成されます。

source: An abstract syntax tree, or AST, is a data structure which represents the parsed version of the text.
ja: 抽象構文木またはASTは、テキストのパースされたバージョンを表すデータ構造です。

source: An alternative way to resolve a conflict is to write a method with the same name in the class body itself:
ja: 競合を解決する代わりの方法は、同じ名前のメソッドをクラス本体自体に書くことです：

source: An array's sort method returns a sorted version of the array's contents.
ja: 配列のsortメソッドは配列の内容が並べ替えられたバージョンを返します。

source: An earlier section explained that declaring the class Task installed a type object in the namespace.
ja: 以前のセクションで、クラスTaskを宣言することが名前空間に型オブジェクトをインストールすると説明しました。

source: An equivalent explanation applies to ne and !eq.
ja: 等しい説明はneと!eqにも当てはまります。

source: An example is the - operator, which negates the following numeric value, as in my $x = -4.
ja: 例は-演算子です。それは後に続く数値を負数にします。my $x = -4のようになります。

source: An exception handler is just a switch statement on an implicit topic that happens to be the current exception to be dealt with.
ja: 例外ハンドラは分配されて現在の例外になるために起こるトピックで暗黙に文をただスイッチする。

source: An explicit placeholder may also be used:
ja: 明示的なプレースホルダーも使われる：

source: An identifier may also contain isolated apostrophes or hyphens provided the next character is alphabetic.
ja: 識別子は次が英字になっている独立したアポストロフィーまたはハイフンも含むことができます。

source: An idiomatic duplicate word searcher might be:
ja: 慣用的な重複のワードサーチャーは、以下の通りになるかもしれません：

source: Anchor
ja: アンカー

source: Anchors
ja: アンカー

source: And
ja: そして

source: Another approach is to stop cycles from forming during add-dependency by checking whether there's already a dependency running in the other direction.
ja: 別のアプローチは、すでに従属物が他の方向で実行されているかどうかチェックすることでadd-dependencyの間にフォーミングからの循環を止めることです。

source: Another consequence of this is that any block just inside a left parenthesis is immediately called like a bare block, so a multidimensional list comprehension may be written using a block with multiple parameters fed by a for modifier:
ja: これのもう一つの結果は、左括弧内のどんなブロックも裸のブロックのように直ちに呼び出されるので、多次元リストの理解力はfor修飾子で与えられた複数パラメータ付きのブロックを使うことで書き直せる：

source: Another novelty is the declaration of a proto token:
ja: 別の目新しさは、proto token宣言です：

source: Another operator type is the prefix operator, which occurs before a term.
ja: 別の演算子タイプは接頭辞演算子です。そして、それは項の前に出現します。

source: Another regex called dup (short for duplicate) contains a word boundary anchor.
ja: dupと呼ばれる別の正規表現（duplicateの省略）は単語境界アンカーを含みます。

source: Another variant is:
ja: 別の異形は以下の通りです：

source: Any Perl 6 compiler is free to optimize away type checks it knows will succeed.
ja: どのPerl 6でも、型チェックが成功するだろうということを知っている最適化を行うのは自由です。

source: Any block object can be used, not just labels, so to return a value from this iteration of the current block you can say:
ja: ラベルだけでなく任意のオブジェクトを使える。それゆえ、現在のブロックのこのイテレーションから値を返すためにあなたは次のように書くことができる：

source: Any conflicts will occur at this point.
ja: どんな競合でもこの点で生じます。

source: Any further type constraints
ja: 型の制約

source: Any implementation that passes the official test suite can call itself "Perl 6".
ja: 公式テストスイートを通る実装ならなんでも「Perl 6」を名乗ることができます。

source: Any missing methods will cause runtime errors (barring the use of something like AUTOMETH).
ja: 見落としているメソッドは何でも、実行時エラー（AUTOMETHのような何かの使用を妨げる）を引き起こすでしょう。

source: Any other use of the Failure object to extract a normal value will throw its associated exception immediately.
ja: 通常の値を取り出すための何か他のFailureオブジェクトの使用はそれに関連付けられた例外を即座にスローする。

source: Any parcels in the returned list are normally flattened when bound into flat context.
ja: 返されたリストのどんなパーセルでも、フラットコンテキストにバインドされた時に通常は平坦化される。

source: Any parts of the string which match but not as part of captures will not appear in the values that caps returns.
ja: 文字列にマッチしても、キャプチャーの一部ではない部分は何であれcapsの返す値には現れません。

source: Any remaining special variables will be lexically scoped.
ja: 残りの特殊変数はレキシカルスコープになります。

source: Any rule used within the grammar will be looked for first in the grammar in which it was used, then within its parent(s).
ja: グラマーの範囲内で使ったルールなら何でも、それが使われたグラマーのものが最初に見られ、それからその親の範囲内で見られます。

source: Any type name in rvalue context is parsed as a single type value and expects no arguments following it.
ja: rvalueコンテキストの型名は単独の型の値としてパースされ、なんの引数も期待しません。

source: Any type name used as a value is the undefined prototype object of that type, or type object for short.
ja: 値として使われる型名は何でもその型の未定義のプロトタイプオブジェクト、略して型オブジェクトです。

source: Any undefined method call on Nil returns Nil, so that Nil propagates down method call chains.
ja: Nilのどんな未定義のメソッド呼び出しもNilを返します。なのでNilはメソッドコールチェインを伝搬します。

source: Any value can coerce to a boolean in boolean context.
ja: 真偽値コンテキストではどんな値も真偽値に自動型変換できます。

source: Any variable mentioned in a capture exists in the capture as a reference to the variable.
ja: キャプチャーの中に記載された変数は何でも変数へのリファレンスとして存在します。

source: Anything may bind to it, even if it could also bind to an object with one of the other sigils.
ja: たとえそれが他のシギルでもバインドできるとしても、何でもバインドすることができます。

source: Apart from CATCH and CONTROL, which can only occur once, most of these can occur multiple times within the block.
ja: CATCHとCONTROLは別として、それは一回だけ起こる。それらの大部分はブロック内で複数回発生できる。

source: Apostrophe separator
ja: アポストロフィーセパレーター

source: Append a ! to make a named parameter mandatory.
ja: 名前が付けられたパラメータを必須にするには!を追加します。

source: Appending a question mark to a quantifier makes it non-greedy (footnote: The non-greedy general quantifier is $thing **?
ja: 数量詞にクエスチョンマークを追加すると非貪欲にします。（脚注：非貪欲な一般的な数量詞は$thing **?

source: Are these functions also methods?
ja: これらの関数もメソッドですか？

source: Arguments bound to the formal parameters of a pointy block are by default readonly within the block.
ja: ポインティブロックの仮パラメータにバインドされた引数はブロック内ではデフォルトで読み取り専用だ。

source: Array and List would work, but are hard to get right.
ja: ArrayとListは動作しますが、正しくするのは難しいです。

source: Arrays store ordered lists.
ja: 配列は順序リストを格納します。

source: Arrays within curly braces are interpolated with a single space character between each item.
ja: ブレースの中の配列は、各々のアイテムの間に一つの空白文字が差し込まれます。

source: As a general rule, only the simplest subroutines benefit from implicit return.
ja: 一般に、最も単純なサブルーチンだけが暗黙のreturnの恩恵を受けます。

source: As a shortcut, $/[0] is also available under the name $0, $/[1] as $1, and so on.
ja: ショートカットとして$/[0]は名前$0でも利用できます。同様に$/[1]は$1です。
